/*************************************

>「 脚本名称 」         Sorted解锁Pro
>「 脚本作者 」         M̆̈̆̈ĭ̈̆̈k̆̈̆̈ĕ̈
>「 电报频道 」         https://t.me/TrollStoreKios 
>「 更新时间 」         2024-09-25
>「 注意事项 」         如需引用请注明出处，谢谢合作！
>「 注意事项 」         使用此脚本，会导致AppleStore无法切换账户，解决方法[关闭QX切换账户，或关闭MITM，或删除脚本，或去设置媒体与购买项目处切换ID]
>「 额外说明 」         请勿传播或售卖此脚本

[rewrite_local]
^https?:\/\/api\.sortedapp\.com\/receipt$ url script-response-body https://raw.githubusercontent.com/Mike-offers/Rewrite/refs/heads/master/QuantumultX/Sorted.js

[mitm]
hostname = api.sortedapp.com

*************************************/

var Mike=JSON["\u0070\u0061\u0072\u0073\u0065"]($response["\u0062\u006f\u0064\u0079"]);var data={"\u0073\u0074\u0061\u0074\u0075\u0073":0x0,"\u0072\u0065\u0063\u0065\u0069\u0070\u0074":{"\u0072\u0065\u0063\u0065\u0069\u0070\u0074\u005f\u0074\u0079\u0070\u0065":"\u0050\u0072\u006f\u0064\u0075\u0063\u0074\u0069\u006f\u006e","\u0061\u0070\u0070\u005f\u0069\u0074\u0065\u006d\u005f\u0069\u0064":0x4de59cd6,"\u0072\u0065\u0063\u0065\u0069\u0070\u0074\u005f\u0063\u0072\u0065\u0061\u0074\u0069\u006f\u006e\u005f\u0064\u0061\u0074\u0065":'2022-09-21\x2011:40:33\x20Etc/GMT',"\u0062\u0075\u006e\u0064\u006c\u0065\u005f\u0069\u0064":"\u0063\u006f\u006d\u002e\u0073\u0074\u0061\u0079\u0073\u006f\u0072\u0074\u0065\u0064\u002e\u0053\u006f\u0072\u0074\u0065\u0064","\u006f\u0072\u0069\u0067\u0069\u006e\u0061\u006c\u005f\u0070\u0075\u0072\u0063\u0068\u0061\u0073\u0065\u005f\u0064\u0061\u0074\u0065":'2020-08-12\x2000:06:22\x20Etc/GMT',"\u0069\u006e\u005f\u0061\u0070\u0070":[],"\u0061\u0064\u0061\u006d\u005f\u0069\u0064":0x4de59cd6,"\u0072\u0065\u0063\u0065\u0069\u0070\u0074\u005f\u0063\u0072\u0065\u0061\u0074\u0069\u006f\u006e\u005f\u0064\u0061\u0074\u0065\u005f\u0070\u0073\u0074":'2022-09-21\x2004:40:33\x20America/Los_Angeles',"\u0072\u0065\u0071\u0075\u0065\u0073\u0074\u005f\u0064\u0061\u0074\u0065":'2022-09-21\x2011:40:35\x20Etc/GMT','request_date_pst':'2022-09-21\x2004:40:35\x20America/Los_Angeles',"\u0076\u0065\u0072\u0073\u0069\u006f\u006e\u005f\u0065\u0078\u0074\u0065\u0072\u006e\u0061\u006c\u005f\u0069\u0064\u0065\u006e\u0074\u0069\u0066\u0069\u0065\u0072":0x32cb6043,'request_date_ms':'1663760435501',"\u006f\u0072\u0069\u0067\u0069\u006e\u0061\u006c\u005f\u0070\u0075\u0072\u0063\u0068\u0061\u0073\u0065\u005f\u0064\u0061\u0074\u0065\u005f\u0070\u0073\u0074":'2020-08-11\x2017:06:22\x20America/Los_Angeles','application_version':"\u0033\u0035\u0038",'original_purchase_date_ms':"\u0031\u0035\u0039\u0037\u0031\u0039\u0030\u0037\u0038\u0032\u0030\u0030\u0030",'receipt_creation_date_ms':'1663760433000',"\u006f\u0072\u0069\u0067\u0069\u006e\u0061\u006c\u005f\u0061\u0070\u0070\u006c\u0069\u0063\u0061\u0074\u0069\u006f\u006e\u005f\u0076\u0065\u0072\u0073\u0069\u006f\u006e":'185',"\u0064\u006f\u0077\u006e\u006c\u006f\u0061\u0064\u005f\u0069\u0064":0x4b8d57950e78},"\u0069\u0073\u0050\u0072\u006f":!![],'environment':'Production',"\u0066\u006c\u0061\u0067\u0067\u0065\u0064":![],'isBundleEnabled':!![],"\u0069\u0073\u0043\u0075\u0073\u0074\u006f\u006d\u0065\u0072":![]};const vip="yfirev/".split("").reverse().join("");if($request['url']['indexOf'](vip)!=-(0x22a08^0x22a09)){Mike=data;body=JSON['stringify'](Mike);}$done({'body':body});
